Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkSymbol Class
 The SectionMarkSymbol class is for section mark attributes related to the shape of the connecting symbol.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.SectionMarkBase.SectionMarkSymbol
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class SectionMarkSymbol : GenericAttributesBase
<SerializableAttribute>
Public Class SectionMarkSymbol
	Inherits GenericAttributesBase
The SectionMarkBase.SectionMarkSymbol type exposes the following members.
Constructors
Name | Description
SectionMarkBase.SectionMarkSymbol()
 Creates a new section mark symbol instance.
SectionMarkBase.SectionMarkSymbol(SectionMarkBase.SectionMarkSymbol.SymbolShapes, Double, Point)
 Creates a new section mark symbol instance with the given shape, size and position.
Top
Properties
Name | Description
Position
 The position of the section mark symbol.
Shape
 The shape of the section mark symbol.
Size
 The size of the section mark symbol.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace